# MEPAnalyticalModelData Properties

---
The MEPAnalyticalModelData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace